package homelesson;

/**
 * Created by admin on 24.10.2016.
 */
public class HomeWork3 {

    /* Написать свое небольшое приложение. В котором у вас будет фабрика по производству автомобилей, или одежды, или техники.
    на свое усмотрение. Постройте цепочку наследования от одного родительского класса к наследникам. (Сделайте 2-3 уровня наследования)
    Данные Вашего продукта держать в модификаторе доступа private.
     Создайте главный класс, через который вы сможете записывать и извлекать информацию с помощью методов
     Часть информации записывайте через конструкторы, а часть через методы set
     Получайте информуцию методами get

     Создайте 3 класса о валюте. К примеру Euro, Hryvnia, Dollar
     создайте клас Клиента, и поле (переменную) для записи информации о сумме платежа и валюте платежа.
     В классе клиента следует создавать обьект (переменную) класов валюты. А уже в классе валюты вы запишете инфу о сумме.
     И тогда когда вы Создадите обьект клиента в главном класе, то сможете вызвать определенную валюту и сумму.
     Далее включаем креативность. Суть задачи в том, что бы определить куда отправить груз.

     Надо создать метод который определит это.
     Если клиент заплатил в долларах  - груз идет в США
     Если в Евро - в Европу
     Если в Гривне - в Бровары

     в идеале это проверить можно с помощью instance of

     Если обьект dollar произошел от Dollar, то груз летит в США

     Работаем на креативность. Задача такая что каждый ее уже может реальизовать по своему!
     Поетому не будем ее разберать на лекции и лучше что бы вы скинули все мне до лекции то что получилось.
      А я с Вами поработаю онлайн.
    */
}
